real-silentsin/CH32V003A4M6_MegaPack_Library/app_config.h
// ----------------------------------------------------------------------------
// Глобальные настройки проекта для CH32V003 MEGAPACK
// ----------------------------------------------------------------------------
#ifndef __APP_CONFIG_H__
#define __APP_CONFIG_H__
// ----------------------------------------------------------------------------
// ******************************************************************************************

#include "ch32v00x.h"
#include "SSS_Common_Lib_V1/sss_classes.h"
// ----------------------------------------------------------------------------
// Набор оборудования проекта, закомментируйте ненужное, добавьте нужное
// ----------------------------------------------------------------------------
// ⚠️ Подключая драйвера здесь, включайте пакет этого драйвера в сборку в панели "Explorer" -
// "Include/Exclude From Build", и отключайте пакеты при отключении оборудования в этом файле!
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется транспорт для внешних связей
#define USE_TRANSPORT_UART
// ----------------------------------------------------------------------------
// ⚠️ Использовать SPI шину для подключения устройств
#define USE_SPI_DEVICES
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется шина I2C
// #define USE_I2C
// ----------------------------------------------------------------------------
// Скорость порта для обмена (921600 - максимум для моста USB CH340) и отладки
#define UART_WORK_BAUDRATE              921600
// ----------------------------------------------------------------------------
#ifdef USE_SPI_DEVICES
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется флеш память серии W25Q
#define USE_FLASH_W25Q
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется TFT SPI дисплей ОСНОВНОЙ
#define USE_TFT_ST7789
// ----------------------------------------------------------------------------
#ifdef USE_TFT_ST7789
// ⚠️ Использует ли дисплей сигнал RST
// #define USE_TFT_ST7789_RST
#endif
// ----------------------------------------------------------------------------
#ifndef USE_TFT_ST7789
// В проекте используется графический OLED SPI дисплей SSD1306 (7pin) ОСНОВНОЙ
//#define USE_OLED_SSD1306
// ----------------------------------------------------------------------------
#ifdef USE_OLED_SSD1306
// Использует ли дисплей сигнал RST
//#define USE_OLED_SSD1306_RST
#endif
#endif
#endif
// ----------------------------------------------------------------------------
#ifdef USE_I2C
// В проекте используется текстовый OLED I2C дисплей SSD1306 (I2C адаптер)
// Модуль "SSS_SSD1306_TXT_V5"
// Может быть использован совместно с графическим SPI дисплеем
// #define USE_OLED_SSD1306_TXT_I2C
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется графический OLED I2C дисплей SSD1306 (I2C адаптер)
// Модуль "SSD1306_GR_I2CHW_V6"
// Может быть использован совместно с графическим SPI дисплеем
#define USE_OLED_SSD1306_GR6_I2C
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется графический LCD I2C дисплей ST920 (128x64, I2C адаптер)
// #define USE_LCD_ST920
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется LCD 1602A через I2C адаптер
// #define USE_LCD1602_I2C
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется DAC MCP4725
// #define USE_DAC_MCP4725
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется контроллер 7-сегментных индикаторов I2C
// #define USE_HT16K33
// ----------------------------------------------------------------------------
#endif /* USE_I2C */
// ----------------------------------------------------------------------------
// Если используются измерения постоянного напряжения, подключите библиотеку <SSS_ADC_SimpleLib_V1>.
// ⚠️ Внимание! В этом оборудовании доступны каналы A0-A3 при условии, что их не занимает другое оборудование.
// Библиотека в настройках не нуждается. Перед измерением один раз запустите метод "ADC_PowerSafe_Init();"
// #define USE_ADC_Measure
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется датчик IR (протокол NEC)
// #define USE_IR_NEC
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется синтезатор звука
#define USE_SOUND_GEN
// ----------------------------------------------------------------------------
// ⚠️ Проект использует PWM генерацию (таймер TIM2)
//#define USE_PWM
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется энкодер EC11
//#define USE_ENCODER_EC11
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется драйвер датчиков DS18B20
// #define USE_DS18B20
// ----------------------------------------------------------------------------

// ----------------------------------------------------------------------------
// Выбор транспорта (Hardware/Software)
// ----------------------------------------------------------------------------
// Выбор транспорта (Hardware/Software)
// У чипа CH32V003A4M6 (SOP16) только ОДИН вариант
#define USE_SPI_SOFTWARE
// ----------------------------------------------------------------------------
// Выберите, где будет инициализироваться SPI
// -- Если используется Flash-память, то инициализировать SPI должен её драйвер!
// ОСТАВЬТЕ ТОЛЬКО ОДИН НУЖНЫЙ!
#define FLASH_INIT_SPI
// #define TFT_INIT_SPI
// #define OLED_INIT_SPI
// ----------------------------------------------------------------------------
// Константы для идентификации оборудования
#define CONST_HARDWARE_NAME             "MOD-PCB4-V003"
#define CONST_HARDWARE_VERSION          "H1.0"
#define CONST_SOFTWARE_VERSION          "S1.0"
//  ----------------------------------------------------------------------------

//  ----------------------------------------------------------------------------
// ⚠️ Три параметра ниже влияют на расход оперативной памяти!
//  Допустимое количество байт в списке sss_byteList (byte[])
#define LIST_MAX_SIZE                   64
// ----------------------------------------------------------------------------
// Максимально допустимое количество пунктов в меню приложения
#define MENU_MAX_ITEMS                  16
// ----------------------------------------------------------------------------
// Максимальный уровень погружения - вложенности меню!
#define MAX_MENU_LEVELS                 8
//  ----------------------------------------------------------------------------

