real-silentsin/CH32V003A4M6_MegaPack_Library/app_config.h
// ******************************************************************************************

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки аппаратного USART для связи с ББ
// ----------------------------------------------------------------------------
#ifdef USE_TRANSPORT_UART
// ----------------------------------------------------------------------------
#define USART_DEV                       USART1

#define USART_IRQ                       USART1_IRQn
#define USART_RCC                       RCC_APB2Periph_USART1
#define USART_HANDLER                   USART1_IRQHandler
// ----------------------------------------------------------------------------
static const PinDefine_t USART_TX_PORT = {  // PD5
    .rcc =                              RCC_APB2Periph_GPIOD,
    .port =                             GPIOD,
    .pin =                              GPIO_Pin_5
};
// ----------------------------------------------------------------------------
static const PinDefine_t USART_RX_PORT = {  // PD6
    .rcc =                              RCC_APB2Periph_GPIOD,
    .port =                             GPIOD,
    .pin =                              GPIO_Pin_6
};
// ----------------------------------------------------------------------------
#endif
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки программного SPI
// ----------------------------------------------------------------------------
#ifdef  USE_SPI_SOFTWARE
// ----------------------------------------------------------------------------
// Если софтверный SPI должен поддерживать полный дуплекс, раскомментируйте этот флаг!
#define SPISW_FULL_DUPLEX
// ----------------------------------------------------------------------------
// 1. Выбор режима (ОСТАВЬТЕ ТОЛЬКО ОДИН)
// #define SPISW_MODE_1
#define SPISW_MODE_3
// ----------------------------------------------------------------------------
// ЗАКОММЕНТИРУЙ ЭТО, чтобы выжать максимум скорости (для W25Q32 / Экранов)
// РАСКОММЕНТИРУЙ ЭТО, если нужна работа с медленной периферией через SetSpeed()
//#define SPISW_USE_DELAY
// ----------------------------------------------------------------------------
// Определяем физические адреса портов и номера пинов программного SPI
// ----------------------------------------------------------------------------
static const PinDefine_t SPISW_SCK_PORT = {  // PC3
    .rcc =                              RCC_APB2Periph_GPIOC,
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_3
};
// ----------------------------------------------------------------------------
static const PinDefine_t SPISW_MOSI_PORT = {  // PC4
    .rcc =                              RCC_APB2Periph_GPIOC,
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_4
};
// ----------------------------------------------------------------------------
#ifdef SPISW_FULL_DUPLEX
static const PinDefine_t SPISW_MISO_PORT = {  // PC6
    .rcc =                              RCC_APB2Periph_GPIOC,
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_6
};
#endif
// ----------------------------------------------------------------------------
#endif /* USE_SPI_SOFTWARE */
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки PWM
// ----------------------------------------------------------------------------
#ifdef USE_PWM
// ----------------------------------------------------------------------------
// Определение, какие каналы PWM используются. Таймер TIM2
// Пины указаны для варианта корпуса SOP16 (ремап по умолчанию)
// Канал 2 не существует!
#define PWM_USE_CH_1  // PD4
#define PWM_USE_CH_3  // PC0
#define PWM_USE_CH_4  // PD7
// ----------------------------------------------------------------------------
#ifdef PWM_USE_CH_1
static const PinDefine_t PWM1_PORT = {  // PD4
    .rcc =                              RCC_APB2Periph_GPIOD,
    .port =                             GPIOD,
    .pin =                              GPIO_Pin_4
};
#endif
#ifdef PWM_USE_CH_3
static const PinDefine_t PWM3_PORT = {  // PC0
    .rcc =                              RCC_APB2Periph_GPIOC,
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_0
};
#endif
#ifdef PWM_USE_CH_4
static const PinDefine_t PWM4_PORT = {  // PD7
    .rcc =                              RCC_APB2Periph_GPIOD,
    .port =                             GPIOD,
    .pin =                              GPIO_Pin_7
};
#endif
// ----------------------------------------------------------------------------
// Таблица готовых значений ARR при Fsys=48МГц
// ***********************************************************
// *    Частота PWM     |  PSC  |  ARR  | Разрешение (шагов) *
// ***********************************************************
// *  100 kHz           |   0   |  479  |        480         *
// *  20 kHz            |   0   | 2399  |       2400         *
// *  10 kHz            |   0   | 4799  |       4800         *
// *  1 kHz             |  47   |  999  |       1000         *
// *  50 Hz (servo)     |  47   | 19999 |      20000         *
// ***********************************************************
// ----------------------------------------------------------------------------
#endif
// ----------------------------------------------------------------------------

