real-silentsin/CH32V003A4M6_MegaPack_Library/app_config.h
// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки I2C
// ----------------------------------------------------------------------------
#ifdef USE_I2C
// ⚠️ ВНИМАНИЕ! I2C здесь только в Default карте пинов!
// ----------------------------------------------------------------------------
// Собственный адрес мастера шины
#define I2C_SELF_ADDRESS                0x02
// ----------------------------------------------------------------------------
// Допустимые режимы работы по скорости шины (оставьте один!)
//#define I2C_SPEED_STANDARD_MODE         100000
#define I2C_SPEED_FAST_MODE             400000
//#define I2C_SPEED_FAST_MODE_PLUS        1000000
// ----------------------------------------------------------------------------
static const PinDefine_t I2C_SDA_PORT = {  // PC1
    .rcc =                              RCC_APB2Periph_GPIOC,
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_1
};
// ----------------------------------------------------------------------------
static const PinDefine_t I2C_SCL_PORT = {  // PC2
    .rcc =                              RCC_APB2Periph_GPIOC,
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_2
};
// ----------------------------------------------------------------------------
#endif  /* USE_I2C */
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки OLED SSD1306 I2C текстовый
// ----------------------------------------------------------------------------
#ifdef USE_OLED_SSD1306_TXT_I2C
// ----------------------------------------------------------------------------
// I2C адрес чипа на шине
#define SSD1306_CHIP_SAVEADDR           0x78
// -----------------------------------------------------------------------------
// ВНИМАНИЕ!!! Физический размер матрицы, оставьте только один!
// Правится пользователем!
// #define SSD1306_DISPLAY_DIMENSIONS_128X32
#define SSD1306_DISPLAY_DIMENSIONS_128X64
// -----------------------------------------------------------------------------
// Использовать новый вариант инициализации (освобождает 10 байт)
// #define SSD1306_USE_NEW_INIT
// -----------------------------------------------------------------------------
// Использовать шрифт из внешнего EEPROM!
// Если фонты находятся в FONTS.h, закомментируйте это!
// #define SSD1306_USE_EEPROM_FONTS
// -----------------------------------------------------------------------------
// Разрешить методы расширенной печати
#define SSD1306_USE_PRINTEX
// -----------------------------------------------------------------------------
// Если используется мой набор фонтов, раскомментируйте этот флаг для того,
// чтобы можно было использовать кириллицу прямо в тексте программ для вывода
// на экран. Внимание! Текст должен быть кодирован в UTF8!
#define SSD1306_USE_MY_FONTS
// -----------------------------------------------------------------------------
#ifdef SSD1306_USE_EEPROM_FONTS
// Максимальный индекс загружаемого символа
// В стандартном наборе vantr - 160 символов
#define SYMBOLS_COUNT_IN_EPROM 203
// -----------------------------------------------------------------------------
// Физический адрес [A0-A2] чипа на шине I2C
#define EEPROM_PHY_ADDR 0
#endif
// ----------------------------------------------------------------------------
#endif /* USE_OLED_SSD1306_TXT_I2C */
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки FTF ST7789 SPI графический
// ----------------------------------------------------------------------------
#ifdef USE_TFT_ST7789
// ----------------------------------------------------------------------------
// Определяем пины управления TFT дисплеем
// ----------------------------------------------------------------------------
static const PinDefine_t ST7789_SC_PORT = {  // PD7
    .rcc =                              RCC_APB2Periph_GPIOD,
    .port =                             GPIOD,
    .pin =                              GPIO_Pin_7
};
// ----------------------------------------------------------------------------
static const PinDefine_t ST7789_DC_PORT = {  // PD4
    .rcc =                              RCC_APB2Periph_GPIOD,
    .port =                             GPIOD,
    .pin =                              GPIO_Pin_4
};
// ----------------------------------------------------------------------------
#ifdef USE_TFT_ST7789_RST
static const PinDefine_t ST7789_RST_PORT = {  // PX100 (заглушка)
    .rcc =                              RCC_APB2Periph_GPIOX,
    .port =                             GPIOX,
    .pin =                              GPIO_Pin_100
};
#endif
// ----------------------------------------------------------------------------
#endif /* USE_TFT_ST7789 */
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки OLED SSD1306 SPI графический
// ----------------------------------------------------------------------------
#ifdef USE_OLED_SSD1306
// ----------------------------------------------------------------------------
// Определяем пины управления OLED дисплеем
// ----------------------------------------------------------------------------
static const PinDefine_t SSD1306_SC_PORT = {  // PD7
    .rcc =                              RCC_APB2Periph_GPIOD,
    .port =                             GPIOD,
    .pin =                              GPIO_Pin_7
};
// ----------------------------------------------------------------------------
static const PinDefine_t SSD1306_DC_PORT = {  // PD4
    .rcc =                              RCC_APB2Periph_GPIOD,
    .port =                             GPIOD,
    .pin =                              GPIO_Pin_4
};
// ----------------------------------------------------------------------------
#ifdef USE_OLED_SSD1306_RST
static const PinDefine_t SSD1306_RST_PORT = {  // PX100 (заглушка)
    .rcc =                              RCC_APB2Periph_GPIOX,
    .port =                             GPIOX,
    .pin =                              GPIO_Pin_100
};
#endif
// ----------------------------------------------------------------------------
#endif /* USE_OLED_SSD1306 */
// ----------------------------------------------------------------------------

