real-silentsin/CH32V003A4M6_MegaPack_Library/app_config.h
// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки OLED SSD1306 I2C графический
// ----------------------------------------------------------------------------
#ifdef USE_OLED_SSD1306_GR6_I2C
// -----------------------------------------------------------------------------
// ВНИМАНИЕ!!! Физический размер матрицы, оставьте только один!
// Правится пользователем!
// #define SSD1306_DISPLAY_DIMENSIONS_128X32
#define SSD1306_DISPLAY_DIMENSIONS_128X64
// ----------------------------------------------------------------------------
// I2C адрес чипа на шине
#define SSD1306_CHIP_SAVEADDR           0x78
// -----------------------------------------------------------------------------
// Использовать новый вариант инициализации (освобождает 10 байт)
// #define SSD1306_USE_NEW_INIT
// -----------------------------------------------------------------------------
// Использовать шрифт из внешнего EEPROM!
// Если фонты находятся в FONTS.h, закомментируйте это!
// #define SSD1306_USE_EEPROM_FONTS
// -----------------------------------------------------------------------------
#ifdef SSD1306_USE_EEPROM_FONTS
// Максимальный индекс загружаемого символа
// В стандартном наборе vantr - 160 символов
#define SYMBOLS_COUNT_IN_EPROM 197
// -----------------------------------------------------------------------------
// Физический адрес [A0-A2] чипа на шине I2C
#define EEPROM_PHY_ADDR 0
#endif
// ----------------------------------------------------------------------------
#endif /* USE_OLED_SSD1306_GR6_I2C */
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки Энкодера EC11 (не настраивался!)
// ----------------------------------------------------------------------------
#ifdef USE_ENCODER_EC11
// ----------------------------------------------------------------------------
// Определяем пины управления Энкодером
// ----------------------------------------------------------------------------
// Если кнопка энкодера не используется, закомментируйте строку ниже
#define ENC_EC11_USE_BUTTON
// -----------------------------------------------------------------------------
// Line A
// ⚠️ ВНИМАНИЕ ДЛЯ CH32X033: Пины для линии A брать строго от 0 до 7!
static const ExtPinDefine_t ENC_EC11_A = { // PD0
    .port =                             GPIOD,
    .pin =                              GPIO_Pin_0,
    .rcc =                              RCC_APB2Periph_GPIOD,
    .exti_port_src =                    GPIO_PortSourceGPIOD,
    .exti_pin_src =                     GPIO_PinSource0,
    .exti_line =                        EXTI_Line0
};
// -----------------------------------------------------------------------------
// Line B
static const PinDefine_t ENC_EC11_B = {  // PD2
    .rcc =                              RCC_APB2Periph_GPIOD,
    .port =                             GPIOD,
    .pin =                              GPIO_Pin_2
};
// -----------------------------------------------------------------------------
#ifdef ENC_EC11_USE_BUTTON
// Line for Button
static const PinDefine_t ENC_EC11_BUTTON = {  // PD7
    .rcc =                              RCC_APB2Periph_GPIOD,
    .port =                             GPIOD,
    .pin =                              GPIO_Pin_7
};
#endif
// ----------------------------------------------------------------------------
#endif /* USE_ENCODER_EC11 */
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки звука
// ----------------------------------------------------------------------------
#ifdef USE_SOUND_GEN
// ----------------------------------------------------------------------------
// Настройки воспроизведения звука TIM2
// ----------------------------------------------------------------------------
// Задержка для формирования частоты семплирования синтезатора
#define SOUND_FM_DELAY_US               125  // Сэмплы 8000Гц
// ----------------------------------------------------------------------------
// Ремап TIM1 RM_01
#define SOUND_TIM1_REMAP() GPIO_PinRemapConfig (GPIO_PartialRemap1_TIM1, ENABLE)
// ----------------------------------------------------------------------------
// Настройка аудио-выхода: задаем регистр сравнения для нужного канала
// Выбор ОДНОГО канала, настроенного на выход для генерации звука
#define AUDIO_PWM_REG (TIM1->CH3CVR)
// ----------------------------------------------------------------------------
// Это пин для выхода ШИМ
static const PinDefine_t SND_OUT_PORT = {  // TIM1:CH3 - PC0
    .rcc =                              RCC_APB2Periph_GPIOC,
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_0
};
// ----------------------------------------------------------------------------
#endif /* USE_SOUND_GEN */
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки IR (протокол NEC) не настроено!
// ----------------------------------------------------------------------------
#ifdef USE_IR_NEC
// ----------------------------------------------------------------------------
// Порт для линии IR (используется прерывание)
// ----------------------------------------------------------------------------
// ⚠️ ВНИМАНИЕ ДЛЯ CH32V033: Отраничения пока не установлены
static const ExtPinDefine_t IR_NEC_PORT = {  // PC3
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_3,
    .rcc =                              RCC_APB2Periph_GPIOC,
    .exti_port_src =                    GPIO_PortSourceGPIOC,
    .exti_pin_src =                     GPIO_PinSource3,
    .exti_line =                        EXTI_Line3
};
// ----------------------------------------------------------------------------
#endif
// ----------------------------------------------------------------------------

