real-silentsin/CH32V003A4M6_MegaPack_Library/app_config.h
// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройка DS18B20
// ----------------------------------------------------------------------------
#ifdef USE_DS18B20
// ----------------------------------------------------------------------------
// Это пин для подключения датчиков
static const PinDefine_t ONEWARE_PORT = {  // PD0
    .rcc =                              RCC_APB2Periph_GPIOD,
    .port =                             GPIOD,
    .pin =                              GPIO_Pin_0
};
// ----------------------------------------------------------------------------
#endif
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки DAC MCP4725
// ----------------------------------------------------------------------------
#ifdef USE_DAC_MCP4725
// ----------------------------------------------------------------------------
// Флаг разрешения полного режима передачи
#define DAC_FULLMODE_ENABLED
// -----------------------------------------------------------------------------
// Максимальное значение на выходе схемы (для блоков питания), mV
#define HARDWARE_VOLTAGE_MAX            3300
// -----------------------------------------------------------------------------
// Питание DAC в милливольтах для расчета значений установки напряжения
// Чем точнее будет указано это значение, тем точнее будет выходное напряжение
#define U_REF_VALUE                     3300  // mV
// -----------------------------------------------------------------------------
// Коррекция падения напряжения на выходных ключах (mV)
#define U_OUT_CORRECT                   0
// -----------------------------------------------------------------------------
// Аппаратный адрес DAC
// -----------------------------------------------------------------------------
// MCP4725A1T-E/CH
//                                                 ----AAA-
//                                                 HHHH210M
#define HA_MCP4725                      0xC4  // 0b11000100 (это на реальный чип)
// #define HA_MCP4725                   0xC0 // 0b11000000 (это для симуляции в Proteus)
//  ----------------------------------------------------------------------------
#endif
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройка LCD1602A через I2C адаптер
// ----------------------------------------------------------------------------
#ifdef USE_LCD1602_I2C
// ----------------------------------------------------------------------------
// Раскомментируйте строку, если дисплей четырехстрочный!
// #define DISPLAY_IS_2004
// -----------------------------------------------------------------------------
// Выбор конструкции модуля. Оставьте только один!
#define USE_CHINESE_I2C_MODULE
// #define USE_MY_I2C_MODULE
// #define USE_MY_NEW_3V_MODULE
// ----------------------------------------------------------------------------
#endif
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройка ST920 через I2C адаптер
// ----------------------------------------------------------------------------
#ifdef USE_LCD_ST920
// ----------------------------------------------------------------------------
// Выбор конструкции модуля. Оставьте только один!
// #define USE_CHINESE_I2C_MODULE
// #define USE_MY_I2C_MODULE
#define USE_MY_NEW_3V_MODULE
// ----------------------------------------------------------------------------
#endif
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройка HT16K33 I2C
// ----------------------------------------------------------------------------
// ⚠️ Внимание! Если используются нестандартные адреса знакомест, правьте массив HT_DIGITS_ADDRESS в файле HT16K33.h
// ----------------------------------------------------------------------------
#ifdef USE_HT16K33
// ----------------------------------------------------------------------------
// Адрес первого чипа на шине I2C
#define HT16K33_I2C_ADDR                0xE0  // 28-pin корпус
// -----------------------------------------------------------------------------
// Номер чипа на
#define HT16K33_CHIP_NUMBER             0
// -----------------------------------------------------------------------------
// Номер бита для представления децимальной точки
#define HT_DP_BIT                       7
// ----------------------------------------------------------------------------
#endif
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки W25Q
// ----------------------------------------------------------------------------
#ifdef USE_FLASH_W25Q
// ----------------------------------------------------------------------------
// Если не используете вывод дебага, закомментируйте этот флаг
#define USE_W25Q_DEBUG
// ----------------------------------------------------------------------------
// Настройка параметров массива флеш-памяти производится в файле hardware.h библиотеки SSS_W25Qxx_Lib_1
// ----------------------------------------------------------------------------
#define W25Q_CHUNK_SIZE                 32   // Количество памяти для индексации поиска файлов
// ----------------------------------------------------------------------------
// Это пин для CS сигнала расширения SPI для флеш-памяти
static const PinDefine_t W25Q_SC_PORT = {      // PС7
    .rcc =                              RCC_APB2Periph_GPIOC,
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_7
};
// ----------------------------------------------------------------------------
#endif /* USE_FLASH_W25Q */
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
#endif /* SPI_CONFIG_H */
// ----------------------------------------------------------------------------